Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Use the interactive patch selection interface to chose which changes to commit.
zh_cn: 使用交互式补丁选择界面选择要提交的更改。

source: Use the selected commit message without launching an editor.
zh_cn: 使用所选的提交信息而不启动编辑器。

source: Use the source ref that matches master (e.g. refs/heads/master) to update the ref that matches satellite/master (most probably refs/remotes/satellite/master) in the mothership repository; do the same for dev and satellite/dev.
zh_cn: 使用与 master 匹配的源引用(例如 refs/heads/master )，更新 mothership 仓库中与 satellite/master 匹配的引用(最可能refs/remotes/satellite/master)，dev 和 satellite/dev 也一样。

source: Use this option to unstage and remove paths only from the index.
zh_cn: 使用此选项可以从索引中取消暂存和移除文件。

source: User-specific configuration file.
zh_cn: 用户特定的配置文件。

source: Users are encouraged to run this task on a regular basis within each repository to maintain good disk space utilization and good operating performance.
zh_cn: 鼓励用户定期在每个仓库内运行此任务，以保持良好的磁盘空间利用率和良好的运行性能。

source: Users migrating from CVS may also want to read gitcvs-migration[7].
zh_cn: 从 CVS 迁移的用户也可能想要读取 gitcvs-migration[7] 。

source: Using --index-filter with git rm yields a significantly faster version.
zh_cn: 使用 --index-filter 和 git rm 可以显着加快版本。

source: Using -f will ignore these unmerged entries.
zh_cn: 使用 -f 将忽略这些未合并的条目。

source: Using Git for collaboration
zh_cn: 使用 Git 进行协作

source: Using an already existing repository as an alternate will require fewer objects to be copied from the repository being cloned, reducing network and local storage costs.
zh_cn: 将已存在的存储库用作备用数据库将需要从要克隆的存储库复制的对象较少，从而降低网络和本地存储成本。

source: Using interactive rebases
zh_cn: 使用交互式 rebases

source: Using more options generally further limits the output (e.g. --since=<date1> limits to commits newer than <date1>, and using it with --grep=<pattern> further limits to commits whose log message has a line that matches <pattern>), unless otherwise noted.
zh_cn: 使用更多选项通常进一步限制输出(例如 --since=<date1> 限制提交比 <date1> 更新，并使用 --grep=<pattern> 进一步限制其日志消息具有与 <pattern> 匹配的行)，除非另有说明。

source: Using refspecs explicitly:
zh_cn: 明确使用 refspecs：

source: Using remote-tracking branches, the same can be done by invoking fetch and merge:
zh_cn: 使用远程跟踪分支，可以通过调用抓取和合并来完成相同的操作：

source: Using “git add -A”
zh_cn: 使用 “git add -A”

source: Using “git commit -a”
zh_cn: 使用 “git commit -a”

source: Usually it is easier to configure any desired options through your personal .ssh/config file.
zh_cn: 通常，通过您的个人 .ssh/config 文件配置任何所需选项更容易。

source: Usually recording a commit that has the exact same tree as its sole parent commit is a mistake, and the command prevents you from making such a commit.
zh_cn: 通常记录与其唯一的父提交完全相同的树的提交是一个错误，并且该命令阻止您进行这样的提交。

source: Usually, the command refuses to update a remote ref that is not an ancestor of the local ref used to overwrite it.
zh_cn: 通常，如果远程引用不是本地引用的祖先，该命令拒绝更新远程引用。

source: Validate packed Git archive files
zh_cn: 验证打包的 Git 归档文件

source: Values
zh_cn: 值

source: Variables
zh_cn: 变量

source: Various Git commands use the following environment variables:
zh_cn: 各种 Git 命令使用以下环境变量：

source: Various commands read from the configuration file and adjust their operation accordingly.
zh_cn: 各种命令从配置文件读取并相应地调整其操作。

source: Various ways to check your working tree
zh_cn: 检查你的工作树的各种方式

source: Verifies the connectivity and validity of the objects in the database
zh_cn: 校验数据库中对象的连接性和有效性

source: Verifies the connectivity and validity of the objects in the database.
zh_cn: 验证数据库中对象的连接性和有效性。

source: Verify the GPG signature of the given tag names.
zh_cn: 验证给定标签名称的 GPG 签名。

source: Videos
zh_cn: 视频

source: Viewing old file versions
zh_cn: 查看旧文件版本

source: Viewing project history
zh_cn: 查看项目历史

source: We can get this using the following command:
zh_cn: 我们可以使用以下命令实现：

source: We divide Git into high level ("porcelain") commands and low level ("plumbing") commands.
zh_cn: 我们将 Git 分为高级(“porcelain”)命令和低级(“plumbing”)命令。

source: We formulate a set of rules for quick reference, while the prose tries to motivate each of them.
zh_cn: 我们制定一组 rules ，以便快速参考，而散文则试图激励他们。

source: We separate the porcelain commands into the main commands and some ancillary user utilities.
zh_cn: 我们将高级命令分为主要命令和一些辅助用户工具。

source: We want our tree to look like this:
zh_cn: 我们希望我们的树看起来像这样：

source: We want to make topic forked from branch master; for example, because the functionality on which topic depends was merged into the more stable master branch.
zh_cn: 我们希望让 topic 分支派生于 master 分支 ;例如，因为 topic 所依赖的功能被合并到更稳定的 master 分支中。

source: What to do when a push fails
zh_cn: 推动失败时该怎么办

source: What you chose are then highlighted with *, like this:
zh_cn: 然后用 * 突出显示您所选择的内容，如下所示：

source: When "git-diff-index", "git-diff-tree", or "git-diff-files" are run with a -p option, "git diff" without the --raw option, or "git log" with the "-p" option, they do not produce the output described above; instead they produce a patch file.
zh_cn: 当使用 -p 选项运行“git-diff-index”，“git-diff-tree”或“git-diff-files”时，“git diff”不带 --raw 选项或“git log”与“-p”选项，它们不产生上述输出;而是产生补丁文件。

source: When interactive, enable the interactive mode of rebase.
zh_cn: 当 interactive 时，启用 rebase 的交互模式。

source: When -u <keyid> is not used, the committer identity for the current user is used to find the GnuPG key for signing.
zh_cn: 当不使用 -u <keyid> 时，当前用户的提交者身份用于查找用于签名的 GnuPG 密钥。

source: When --cached is given, the staged content has to match either the tip of the branch or the file on disk, allowing the file to be removed from just the index.
zh_cn: 当给出 --cached 时，暂存内容必须与分支尖端或磁盘上的文件相匹配，从而仅将该文件从索引中删除。

source: When =<format> part is omitted, it defaults to medium.
zh_cn: 当 =<format> 部分省略时，默认为 medium 。

source: When <format> is none of the above, and has %placeholder in it, it acts as if --pretty=tformat:<format> were given.
zh_cn: 当 <format> 不是上述内容，并且其中有 %placeholder 时，它的行为就好像 --pretty=tformat:<format> 被给予。

source: When <path> arguments are present, compares only paths matching those patterns.
zh_cn: 当存在 <path> 参数时，只比较匹配这些模式的路径。

source: When <paths> or --patch are given, git checkout does not switch branches.
zh_cn: 给出<paths>或 --patch 时， git checkout 不 切换分支。

source: When <type> is not specified, it defaults to "blob".
zh_cn: 当未指定 <type> 时，它默认为 "blob"。

source: When EOF is received on standard input, fast import writes out updated branch and tag refs, fully updating the current repository with the newly imported data.
zh_cn: 当在标准输入上接收到 EOF 时，快速导入会写入更新的分支和标签引用，使用新导入的数据完全更新当前仓库。

source: When a local branch is started off a remote-tracking branch, Git sets up the branch (specifically the branch.<name>.remote and branch.<name>.merge configuration entries) so that git pull will appropriately merge from the remote-tracking branch.
zh_cn: 当本地分支从远程跟踪分支启动时，Git 设置分支(具体为 branch.<name>.remote 和 branch.<name>.merge 配置条目)，以便 git pull 将适当地从远程跟踪分支合并。

source: When a merge conflict happens during switching branches with the -m option, you would see something like this:
zh_cn: 当使用 -m 选项切换分支时发生合并冲突时，您会看到如下：

source: When a ref is updated, reflog entries are created to keep track of the reason why the ref was updated (which is typically the name of the high-level command that updated the ref), in addition to the old and new values of the ref.
zh_cn: 当 ref 被更新时，创建 reflog 条目以跟踪 ref 被更新的原因(通常是更新 ref 的高级命令的名称)，以及 ref 的旧的和新的值。

source: When a variable is said to take a boolean value, many synonyms are accepted for true and false; these are all case-insensitive.
zh_cn: 当一个变量被认为是一个布尔值时，很多同义词被接受为 true 和 false ;这些都是不区分大小写的。

source: When accepting a new code drop for a vendor branch, you probably want to record both the removal of paths and additions of new paths as well as modifications of existing paths.
zh_cn: 当为供应商分支接受新的代码 drop 时，您可能需要记录路径的删除和新路径的添加以及现有路径的修改。

source: When converting value to the canonical form using --bool type specifier, git config will ensure that the output is "true" or "false" (spelled in lowercase).
zh_cn: 当使用 --bool 类型说明符将值转换为规范形式时， git config 将确保输出为“true”或“false”(拼写为小写)。

source: When deciding whether to ignore a path, Git normally checks gitignore patterns from multiple sources, with the following order of precedence, from highest to lowest (within one level of precedence, the last matching pattern decides the outcome):
zh_cn: 在决定是否忽略路径时，Git 通常从多个来源检查 gitignore 模式，从以下优先顺序，从最高到最低(在一个优先级中，最后一个匹配模式决定结果) ：

source: When doing a dry-run, give the output in a porcelain-ready format.
zh_cn: 做 dry-run 时，给出一个高级准备格式的输出。

source: When doing a dry-run, give the output in the long-format.
zh_cn: 做 dry-run 时，以长格式输出。

source: When doing a dry-run, give the output in the short-format.
zh_cn: 做 dry-run 时，以短格式输出。

source: When editing the commit message, start the editor with the contents in the given file.
zh_cn: 编辑提交信息时，使用给定文件中的内容启动编辑器。

source: When false, merge the current branch into the upstream branch.
zh_cn: 当为 false 时，将当前分支合并到上游分支。

source: When files are given on the command line, the command commits the contents of the named files, without recording the changes already staged.
zh_cn: 当命令行给出文件时，该命令将提交指定文件的内容，而不记录已经暂存的更改。

source: When first created, objects are stored in individual files, but for efficiency may later be compressed together into "pack files".
zh_cn: 当第一次创建时，对象存储在单个文件中，但是为了更效率可以稍后压缩成"包文件"。

source: When given a two-part name section.key, the value for section.<url>.key whose <url> part matches the best to the given URL is returned (if no such key exists, the value for section.key is used as a fallback).
zh_cn: 当给出两部分名称 section.key 时，返回 <url> 部分与给定 URL 匹配最佳的<url>.key（如果没有这样的键，则使用 section.key 的值）。

source: When given just the section as name, do so for all the keys in the section and list them.
zh_cn: 当给出该部分作为名称时，对于该部分中的所有键执行此操作，并列出它们。

source: When given, and the repository to clone from is accessed via ssh, this specifies a non-default path for the command run on the other end.
zh_cn: 给定时，通过 ssh 访问要克隆的仓库，这指定了另一端运行的命令的非默认路径。

source: When giving multiple pattern expressions combined with --or, this flag is specified to limit the match to files that have lines to match all of them.
zh_cn: 当给出由 --or 组合的多个正则表达式时，指定该标志用于限制匹配的文件为，有行匹配所有的正则（译注：不一定要在同一行）。

source: When inventing new variables for use in your own tool, make sure their names do not conflict with those that are used by Git itself and other popular tools, and describe them in your documentation.
zh_cn: 当在您自己的工具中使用新变量时，请确保其名称与 Git 本身和其他流行工具使用的名称不冲突，并在文档中进行描述。

source: When it is not obvious how to apply a change, the following happens:
zh_cn: 如果不明白如何应用变更，则会发生以下情况：

source: When multiple -C options are given, each subsequent non-absolute -C <path> is interpreted relative to the preceding -C <path>.
zh_cn: 当给出多个 -C 选项时，相对于前面的 -C <path> 解释每个后续非绝对的 -C <path> 。

source: When multiple values are taken then all values of a key from all files will be used.
zh_cn: 当采用多个值时，将使用所有文件中的所有值的所有值。

source: When neither the command-line nor the configuration specify what to push, the default behavior is used, which corresponds to the simple value for push.default: the current branch is pushed to the corresponding upstream branch, but as a safety measure, the push is aborted if the upstream branch does not have the same name as the local one.
zh_cn: 当命令行和配置都不指定要推送的内容时，使用默认行为，这对应于 push.default 的 simple 值：当前分支被推送到相应的上游分支，但是作为安全措施，如果上游分支不具有与本地分支相同的名称，则推送被中止。

source: When no <stash> is given, it removes the latest one.
zh_cn: 当没有给出 <stash> 时，它会删除最新的。

source: When no remote is specified, by default the origin remote will be used, unless there’s an upstream branch configured for the current branch.
zh_cn: 当没有指定远程时，默认情况下，将使用 origin remote，除非为当前分支配置了上游分支。

source: When pathnames are given, the command makes a commit that only records the changes made to the named paths:
zh_cn: 当给定路径名时，该命令进行提交，该记录仅记录对指定路径所做的更改：

source: When reading, the values are read from the system, global and repository local configuration files by default, and options --system, --global, --local and --file <filename> can be used to tell the command to read from only that location (see FILES).
zh_cn: 读取时，默认情况下，从系统，全局和仓库本地配置文件读取值，并且选项 --system ， --global ， --local 和 --file <filename> 可用于告知命令只从该位置读取(请参阅 FILES )。

source: When rebase exits topic will remain the checked-out branch.
zh_cn: 当 rebase 退出 topic 将仍然是检出的分支。

source: When recording your own work, the contents of modified files in your working tree are temporarily stored to a staging area called the "index" with git add.
zh_cn: 记录自己的工作时，使用 git add 工作树中修改后的文件的内容将暂存到的名为"index"的暂存区域。

source: When run in a directory that does not have ".git" repository directory, Git tries to find such a directory in the parent directories to find the top of the working tree, but by default it does not cross filesystem boundaries.
zh_cn: 当在没有".git"仓库目录的目录中运行时，Git 尝试在父目录中找到这样一个目录，以找到工作树的顶部，但默认情况下不跨越文件系统边界。

source: When running from a subdirectory in a repository, patched paths outside the directory are ignored.
zh_cn: 从仓库的子目录运行时，目录之外的补丁将被忽略。

source: When set to preserve, rebase with the --preserve-merges option passed to git rebase so that locally created merge commits will not be flattened.
zh_cn: 当设置为保留时，使用 --preserve-merges 选项传递到 git rebase ，以便本地创建的合并提交将不会被 flattened 。

source: When showing "other" files, show only those matched by an exclude pattern.
zh_cn: 显示 "其他" 文件时，只显示与排除模式匹配的文件。

source: When showing short or porcelain status output, print the filename verbatim and terminate the entries with NUL, instead of LF.
zh_cn: 当显示 short 或 porcelain 状态输出时，逐字打印文件，并用 NUL 而不是 LF 终止条目。

source: When showing files in the index, print only those matched by an exclude pattern.
zh_cn: 在索引中显示文件时，只打印排除模式匹配的文件。

source: When the <commit> argument is a branch name, the --detach option can be used to detach HEAD at the tip of the branch (git checkout <branch> would check out that branch without detaching HEAD).
zh_cn: 当<commit>参数是一个分支名称时，可以使用 --detach 选项分离头部的分支( git checkout <branch> 将在不分离 HEAD 的情况下检出)。

source: When the color setting for name is undefined, the command uses color.ui as fallback.
zh_cn: 当 name 的颜色设置未定义时，该命令将使用 color.ui 作为备用。

source: When the command enters the interactive mode, it shows the files and directories to be cleaned, and goes into its interactive command loop.
zh_cn: 当命令进入交互模式时，它显示要清理的文件和目录，并进入其交互式命令循环。

source: When the command enters the interactive mode, it shows the output of the status subcommand, and then goes into its interactive command loop.
zh_cn: 当命令进入交互模式时，它显示 status 子命令的输出，然后进入其交互式命令循环。

source: When the command line does not specify what to push with <refspec>... arguments or --all, --mirror, --tags options, the command finds the default <refspec> by consulting remote.*.push configuration, and if it is not found, honors push.default configuration to decide what to push (See git-config[1] for the meaning of push.default).
zh_cn: 当命令行没有使用 <refspec>... 参数或 --all ， --mirror ，--tags选项指定要推送什么时，该命令通过咨询 remote.*.push 配置找到默认的 <refspec> ，如果没有找到，则考 push.default 虑配置来决定要推送的内容(参见 git-config[1] ，了解 push.default 的含义)。

source: When the command line does not specify where to push with the <repository> argument, branch.*.remote configuration for the current branch is consulted to determine where to push.
zh_cn: 当命令行没有指定使用 <repository> 参数推送的位置时，将查询当前分支的 branch.*.remote 配置，以确定要推送的位置。

source: When the environment variable GIT_EXTERNAL_DIFF is set, the program named by it is called, instead of the diff invocation described above.
zh_cn: 当设置环境变量 GIT_EXTERNAL_DIFF 时，调用由其命名的程序，而不是上述的 diff 调用。

source: When the git-rebase command is run, it will first execute a "pre-rebase" hook if one exists.
zh_cn: 当 git-rebase 命令运行时，它将首先执行"pre-rebase"钩子（如果存在）。

source: When the pattern matches the path in question, the attributes listed on the line are given to the path.
zh_cn: 当模式与所讨论的路径匹配时，行上列出的属性被赋予路径。

source: When the prompt ends with double >> like this, you can make more than one selection, concatenated with whitespace or comma.
zh_cn: 当提示以双重的 >> 结束时，您可以进行多个选择，用空格或逗号连接。

source: When the prompt ends with double >>, you can make more than one selection, concatenated with whitespace or comma.
zh_cn: 当提示以双倍的 >> 结束时，您可以进行多个选择，并用空格或逗号连接。

source: When the repository to clone from is on a local machine, this flag bypasses the normal "Git aware" transport mechanism and clones the repository by making a copy of HEAD and everything under objects and refs directories.
zh_cn: 当克隆的存储库在本地机器上时，此标志绕过正常的"Git 感知"传输机制，并通过将 HEAD 的副本和对象和参考目录下的所有内容复制到存储库中。

source: When the repository to clone is on the local machine, instead of using hard links, automatically setup .git/objects/info/alternates to share the objects with the source repository.
zh_cn: 当克隆的存储库在本地机器上时，而不是使用硬链接，自动设置 .git/objects/info/alternates 以与源存储库共享对象。

source: When this option is used, neither remote-tracking branches nor the related configuration variables are created.
zh_cn: 使用此选项时，不会创建远程跟踪分支和相关配置变量。

source: When true, rebase the current branch on top of the upstream branch after fetching.
zh_cn: 如果是，则在抓取之后，变基当前分支到上游分支顶部。

source: When used with -C/-c/--amend options, or when committing after a conflicting cherry-pick, declare that the authorship of the resulting commit now belongs to the committer.
zh_cn: 当与 -C/-c/--amend 选项一起使用时，或在冲突的 cherry-pick 之后提交时，声明所生成的提交的作者身份现在属于提交者。

source: When using the --reference-if-able, a non existing directory is skipped with a warning instead of aborting the clone.
zh_cn: 当使用 --reference-if-able 时，会跳过一个不存在的目录，而不是中止该克隆。

source: When writing, the new value is written to the repository local configuration file by default, and options --system, --global, --file <filename> can be used to tell the command to write to that location (you can say --local but that is the default).
zh_cn: 写入时，默认情况下将新值写入仓库本地配置文件，选项 --system ， --global ， --file <filename> 可以用来告诉命令写入该位置(你可以说 --local ，但这是默认的)。

source: When you are done, run git commit to finally record the merge:
zh_cn: 完成后，运行 git commit 以最终记录合并：

source: When you are in the middle of something, you learn that there are upstream changes that are possibly relevant to what you are doing.
zh_cn: 当你处于某种状态的时候，你会发现上游的变化与你正在做的事情有关。

source: When you are satisfied with the filtered result, press ENTER (empty) back to the main menu.
zh_cn: 当您对过滤后的结果感到满意时，按 ENTER (empty) 返回主菜单。

source: When your local changes do not conflict with the changes in the upstream, a simple git pull will let you move forward.
zh_cn: 当您的本地更改与上游的更改不冲突时，简单的 git pull 将让您向前推进。

source: Whereas a "lightweight" tag is simply a name for an object (usually a commit object).
zh_cn: 而"轻量级"标签只是一个对象的名称(通常是提交对象)。

source: Whether or not incremental imports are supported from a particular foreign source depends on the frontend program in use.
zh_cn: 是否从特定的外部来源支持增量导入取决于正在使用的前端程序。

source: Whether to show a diffstat of what changed upstream since the last rebase.
zh_cn: 是否显示自上次 rebase 之后上游变化的变化。

source: Whether to skip reading settings from the system-wide $(prefix)/etc/gitconfig file.
zh_cn: 是否从系统范围的 $(prefix)/etc/gitconfig 文件中跳过阅读设置。

source: Which file to place a pattern in depends on how the pattern is meant to be used.
zh_cn: 哪个文件用来放置模式，取决于模式要如何使用。

source: Why bisecting merge commits can be harder than bisecting linear history
zh_cn: 为什么平分合并提交可能比平分线性历史更难

source: Wildcards in the pattern such as * or ? are treated as literal characters.
zh_cn: 格式中的通配符（例如 * 或 ? 被视为 literal 字符。

source: With --no-commit perform the merge but pretend the merge failed and do not autocommit, to give the user a chance to inspect and further tweak the merge result before committing.
zh_cn: 使用--no-commit 执行合并，但假装合并失败，并且不自动提交，以便给用户有机会在提交之前检查并进一步调整合并结果。

source: With --contains, shows only the branches that contain the named commit (in other words, the branches whose tip commits are descendants of the named commit), --no-contains inverts it.
zh_cn: 使用 --contains ，只显示包含指定提交的分支(换句话说，分支尖端的提交是指定提交的后代)， --no-contains 反转它。

source: With --no-tags option, git fetch <name> does not import tags from the remote repository.
zh_cn: 使用 --no-tags 选项， git fetch <name> 不会从远程仓储库导入标签。

source: With --tags option, git fetch <name> imports every tag from the remote repository.
zh_cn: 使用 --tags 选项， git fetch <name> 从远程仓库导入每个标签。

source: With -f option, git fetch <name> is run immediately after the remote information is set up.
zh_cn: 使用 -f 选项，在设置远程信息后立即运行 git fetch <name> 。

source: With --merged, only branches merged into the named commit (i.e. the branches whose tip commits are reachable from the named commit) will be listed.
zh_cn: 通过 --merged ，只列出合并到指定提交中的分支(即分枝尖端的提交是从指定指交可达的)。

source: With --no-merged only branches not merged into the named commit will be listed.
zh_cn: 使用--no-merged ，只有没有合并到指定提交中的分支将被列出，。

source: With --rebase, it runs git rebase instead of git merge.
zh_cn: 使用 --rebase ，它运行 git rebase 而不是 git merge 。

source: With -m, changes made to the working tree file can be discarded to re-create the original conflicted merge result.
zh_cn: 使用 -m ，可以丢弃对工作树文件所做的更改，以重新创建原始冲突的合并结果。

source: With a -d or -D option, <branchname> will be deleted.
zh_cn: 使用 -d 或 -D 选项， <branchname> 将被删除。

source: With a -m or -M option, <oldbranch> will be renamed to <newbranch>.
zh_cn: 使用 -m 或 -M 选项，<oldbranch>将被重命名为<newbranch>。

source: With no arguments, shows a list of existing remotes.
zh_cn: 没有参数，显示现有远程的列表。

source: With no options and no COMMAND or GUIDE given, the synopsis of the git command and a list of the most commonly used Git commands are printed on the standard output.
zh_cn: 没有选项，没有给出任何命令或指导， git 命令的概要和最常用的 Git 命令的列表将打印在标准输出上。

source: With optional <pattern>..., e.g. git branch --list 'maint-*', list only the branches that match the pattern(s).
zh_cn: 使用可选的 <pattern>... ，例如 git branch --list 'maint-*' 仅列出与模式匹配的分支。

source: With optional <pattern>..., e.g. git tag --list 'v-*', list only the tags that match the pattern(s).
zh_cn: 使用可选的 <pattern>... ，例如 git tag --list 'v-*' ，仅列出与模式匹配的标签。

source: With the --index option the patch is also applied to the index, and with the --cached option the patch is only applied to the index.
zh_cn: 使用 --index 选项，补丁也应用于索引，使用 --cached 选项，补丁仅应用于索引。

source: With the latter, you can use the manual viewer of your choice; see git-help[1] for more information.
zh_cn: 使用后者，您可以使用您选择的手册查看器;详见 git-help[1] 。

source: With this option, git gc checks whether any housekeeping is required; if not, it exits without performing any work.
zh_cn: 使用此选项， git gc 可检查是否需要任何家政服务;如果没有，则退出而不执行任何工作。

source: Without -f git branch refuses to change an existing branch.
zh_cn: 没有 -f git branch 拒绝更改现有的分支。

source: Without additional configuration, pushes the current branch to the configured upstream (remote.origin.merge configuration variable) if it has the same name as the current branch, and errors out without pushing otherwise.
zh_cn: 没有其他配置，如果上游分支与当前分支具有相同的名称，将当前分支推送到配置的上游( remote.origin.merge 配置变量)，如果名称不相同则出错。

source: Without the -z option, filenames with "unusual" characters are quoted as explained for the configuration variable core.quotePath (see git-config[1]).
zh_cn: 没有 -z 选项，引用了具有"异常"字符的文件名，如配置变量 core.quotePath 所述(参见git-config[1])。

source: Without these options, the command applies the patch only to files, and does not require them to be in a Git repository.
zh_cn: 没有这些选项，该命令将补丁仅应用于文件，并且不要求它们位于 Git 存储库中。

source: Without this option old data in .git/FETCH_HEAD will be overwritten.
zh_cn: 没有这个选项， .git/FETCH_HEAD 中的旧数据将被覆盖。

source: Working branch; defaults to HEAD.
zh_cn: 工作分支；默认为 HEAD。

source: Working tree files, whether modified or not, will be left alone.
zh_cn: 工作树文件（无论是否修改）将被留下。

source: Works like git push <remote>, where <remote> is the current branch’s remote (or origin, if no remote is configured for the current branch).
zh_cn: 像 git push <remote> ，其中<remote>是当前分支的远程(或 origin ，如果没有为当前分支配置远程)。

source: Worktree-specific files such as HEAD or index are taken from $GIT_DIR.
zh_cn: Worktree 特定的文件，例如 HEAD 或索引取自 $GIT_DIR 。
